[
  {
    "sourceName": "The Verge",
    "title": "Apple hit with first ever EU fine following Spotify complaint - The Verge",
    "url": "https://www.theverge.com/2024/3/4/24005938/european-commission-antitrust-apple-investigation-anti-steering-rules-app-developers",
    "urlToImage": "https://cdn.vox-cdn.com/thumbor/dFDl6EcIGxvqgYabdEPxrd1w3QQ=/0x0:3000x2000/1200x628/filters:focal(1500x1000:1501x1001)/cdn.vox-cdn.com/uploads/chorus_asset/file/23925967/acastro_STK045_02.jpg",
    "publishedAt": "2024-03-04T12:09:36Z",
    "description": "Apple has been fined by European Union antitrust regulators and told to allow developers to link users out to their own websites to sign up for their services.",
    "author": "Jon Porter, Jess Weatherbed",
    "content": "Apple hit with first-ever EU fine following Spotify complaint\r\nApple hit with first-ever EU fine following Spotify complaint\r\n / Five years after Spotify first complained about Apples App Store pract… [+5437 chars]",
    "jokes": [
      "So, Apple just received their first EU fine after a complaint from Spotify. I guess you could say they're no longer 'streaming' ahead, they've hit a bit of a 'pause'."
    ]
  },
  {
    "sourceName": "Ars Technica",
    "title": "I worked exclusively in Vision Pro for a week—here's how it went - Ars Technica",
    "url": "https://arstechnica.com/gadgets/2024/03/i-worked-exclusively-in-vision-pro-for-a-week-heres-how-it-went/",
    "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/03/Vision-Pro-windows-760x380.png",
    "publishedAt": "2024-03-04T11:45:46Z",
    "description": "The biggest problem is meetings, as Personas are a bit of a letdown.",
    "author": "Samuel Axon",
    "content": "4\r\n<ul><li>\r\n A close-up look at the Vision Pro from the front. \r\n</li><li>\r\n There are two displays inside the Vision Pro, one for each eye. Each offers just under 4K resolution. \r\n</li><li>\r\n This … [+3867 chars]",
    "jokes": [
      "So I heard about this new device called Vision Pro, it has two displays, one for each eye, each offering just under 4K resolution. It's great, now you can get twice as dizzy from the screen resolution while trying to find the perfect Netflix show!"
    ]
  },
  {
    "sourceName": "CNN",
    "title": "Boston Celtics embarrass the Golden State Warriors in 52-point demolition, win 11th straight game - CNN",
    "url": "https://www.cnn.com/2024/03/04/sport/boston-celtics-golden-state-warriors-blowout-spt-intl/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/2024-03-03t232217z-86142889-mt1usatoday22686259-rtrmadp-3-nba-golden-state-warriors-at-boston-celtics.jpeg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-04T11:39:00Z",
    "description": "The Boston Celtics won their 11th game in a row on Sunday, rolling to a stunning 52-point rout, 140-88, of the Golden State Warriors.",
    "author": "Samuel Joseph",
    "content": "The Boston Celtics won their 11th game in a row on Sunday, rolling to a stunning 52-point rout, 140-88, of the Golden State Warriors.\r\nIn a rematch between the two teams that contested the 2022 NBA F… [+3124 chars]",
    "jokes": [
      "The Boston Celtics beat the Golden State Warriors by 52 points yesterday. Apparently, they misunderstood when someone told them to \"give 'em the old one-two\"!"
    ]
  },
  {
    "sourceName": "Reuters",
    "title": "Scientists reveal secrets of Earth's magnificent desert star dunes - Reuters",
    "url": "https://www.reuters.com/science/scientists-reveal-secrets-earths-magnificent-desert-star-dunes-2024-03-04/",
    "urlToImage": "https://www.reuters.com/resizer/VPCXYxkFaQHA69j9hl7fB_8JtV4=/1920x1005/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/AYNBO2ERRJKWHAIOIPCCJAUDME.jpg",
    "publishedAt": "2024-03-04T11:13:00Z",
    "description": "They are among the wonders of our deserts: star dunes, the vaguely pyramid-shaped sand formations up to about 1,000 feet (300 meters) tall with arms stretching out from a central peak to give them a star-like appearance when viewed from above.",
    "author": "Will Dunham",
    "content": null,
    "jokes": [
      "Scientists have recently revealed secrets of Earth's desert star dunes. I guess even Mother Nature can't keep her sandy secrets from nosy humans anymore!"
    ]
  },
  {
    "sourceName": "NBC News",
    "title": "Why North Carolina is set to host the biggest governor’s race of 2024 - NBC News",
    "url": "https://www.nbcnews.com/politics/2024-election/north-carolina-biggest-governor-race-rcna140863",
    "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-02/240228-split-nc-governor-ch-0844-ead832.jpg",
    "publishedAt": "2024-03-04T11:00:41Z",
    "description": "North Carolina is gearing up to host the biggest governor's race of the 2024 election between Democrat Josh Stein and Republican Mark Robinson.",
    "author": "Adam Edelman",
    "content": "Even before Tuesdays primary votes are tallied, North Carolina is gearing up to host the most pivotal and most expensive governors race in the country this fall.\r\nLeading in the polls and in fundrais… [+8678 chars]",
    "jokes": [
      "\"Well, folks, North Carolina is preparing for the biggest governor’s race of 2024. I guess when they heard about high stakes, they thought it was a barbecue contest!\""
    ]
  },
  {
    "sourceName": "Yahoo Entertainment",
    "title": "February jobs report and Powell's semi-annual testimony: What to know this week - Yahoo Finance",
    "url": "https://finance.yahoo.com/news/february-jobs-report-and-powells-semi-annual-testimony-what-to-know-this-week-130035524.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/NtxkY_Mc1zyFw63sOMKTPw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-02/648d2450-d80d-11ee-965e-a9b10abfe203",
    "publishedAt": "2024-03-04T10:51:06Z",
    "description": "With markets entering another week at record highs, updates on the labor market and a testimony from Federal Reserve chair Jerome Powell will greet investors...",
    "author": "Josh Schafer",
    "content": "The stock market keeps hitting new record highs. \r\nThe S&amp;P 500 (^GSPC) and Nasdaq (^IXIC) both ended last week at their highest levels ever. The S&amp;P 500 has now risen for 16 of the last 18 we… [+6560 chars]",
    "jokes": [
      "You know, the stock market keeps hitting new record highs - it's like the Kardashian family's count of reality shows. And with the S&P 500 rising 16 out of the last 18 weeks, it's starting to feel like my bathroom scale after the holidays."
    ]
  },
  {
    "sourceName": "NPR",
    "title": "The legal tech industry faces its own #MeToo movement - NPR",
    "url": "https://www.npr.org/2024/03/04/1234044153/metoo-legal-tech-legalweek",
    "urlToImage": "https://media.npr.org/assets/img/2024/02/26/gettyimages-1299986427_wide-5ef774e490d36dec9acba12c691f81e0604bcedd-s1400-c100.jpg",
    "publishedAt": "2024-03-04T10:28:04Z",
    "description": "Fed up with what they see as their industry's tolerance of men's transgressions and predatory behavior, women are telling their stories — in person, in group chats and on LinkedIn.",
    "author": "Jaclyn Diaz",
    "content": "Many women, as well as some men, took to social media to share tales of sexual harassment and assault during glitzy legal tech events.\r\nLuke Chan/Getty Images\r\nStefanie Bier was looking forward to ca… [+15042 chars]",
    "jokes": [
      "\"So, the legal tech industry is facing its own #MeToo movement. I guess even Siri told them 'Sorry, I didn't quite catch that. Can you please repeat it in a less creepy way?'\""
    ]
  },
  {
    "sourceName": "CNN",
    "title": "Children starve to death in Gaza, Palestinian officials say, as Israel-Hamas ceasefire deal sticking points remain - CNN",
    "url": "https://www.cnn.com/2024/03/04/middleeast/gaza-children-dying-malnutrition-israel-ceasefire-talks-intl-hnk/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2038834591.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-04T10:05:00Z",
    "description": "A growing number of children in Gaza are dying from dehydration and malnutrition, the Palestinian health ministry said Sunday, amid desperate conditions due to Israel’s throttling of aid and destruction of the besieged enclave — reinforcing the urgency of thi…",
    "author": "Helen Regan",
    "content": "A growing number of children in Gaza are dying from dehydration and malnutrition, the Palestinian health ministry said Sunday, amid desperate conditions due to Israels throttling of aid and destructi… [+5855 chars]",
    "jokes": [
      "I'm really sorry, but it's inappropriate to make jokes about such serious and tragic situations. Let's find another topic that would be suitable for humor."
    ]
  },
  {
    "sourceName": "BBC News",
    "title": "Did the last Budget deliver growth and cheap beer? - BBC.com",
    "url": "https://www.bbc.com/news/uk-politics-68370060",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/10902/production/_132724876_hunt_lozenge-nc.png",
    "publishedAt": "2024-03-04T09:39:32Z",
    "description": "The previous Budget was meant to help growth, investment, pubs and parents. Has it worked so far?",
    "author": null,
    "content": "By Anthony ReubenBBC Verify\r\nChancellor Jeremy Hunt will set out his Budget on 6 March, almost a year after his first spring Budget.\r\nIn the 2023 Budget, he announced measures - including on growth, … [+6878 chars]",
    "jokes": [
      "\"So, I heard that in the latest budget announcement, growth and cheap beer are on the agenda. At this rate, our economy will be booming, but only in beer bellies!\""
    ]
  },
  {
    "sourceName": "BBC News",
    "title": "Rwanda flights bill begins tricky House of Lords stage - BBC.com",
    "url": "https://www.bbc.com/news/uk-politics-68466383",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/12311/production/_132831547_20a8ff5e08894f85bafed0a712b32fc013781db0.jpg",
    "publishedAt": "2024-03-04T09:37:21Z",
    "description": "Peers in Parliament will try to change Rishi Sunak's planned law aimed at deterring channel crossings.",
    "author": null,
    "content": "By Chris MasonPolitical editor, BBC News\r\nThe government's attempts to send some asylum seekers to Rwanda will be voted on by the House of Lords later.\r\nThere will be votes this afternoon and this ev… [+3112 chars]",
    "jokes": [
      "\"So, apparently the British government's plan to send asylum seekers to Rwanda is up for vote in the House of Lords. I guess they figured, 'Who needs the French Riviera when you've got the scenic vistas of Kigali?'\""
    ]
  },
  {
    "sourceName": "Associated Press",
    "title": "The Supreme Court could decide Monday whether Trump can be barred from the 2024 ballot - The Associated Press",
    "url": "https://apnews.com/article/supreme-court-trump-insurrection-election-colorado-51e79c0f03013034c8a042cb278b6446",
    "urlToImage": "https://dims.apnews.com/dims4/default/e2c3b46/2147483647/strip/true/crop/4496x2529+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F7a%2F6e3e3698b75d472cf44bd82c9f1a%2F4913e5ff250b4ade971c32f599ef785a",
    "publishedAt": "2024-03-04T09:23:00Z",
    "description": "Former President Donald Trump could learn Monday whether the Supreme Court will let him appear on this year’s ballot as he tries to close in on the Republican presidential nomination. The justices are expected to decide at least one case Monday, with signs po…",
    "author": "MARK SHERMAN",
    "content": "WASHINGTON (AP) Former President Donald Trump could learn Monday whether the Supreme Court will let him appear on this years ballot as the leading Republican presidential candidate tries to close in … [+2777 chars]",
    "jokes": [
      "So, the Supreme Court might decide if Trump can be on the 2024 ballot. I guess they're just trying to determine if America is ready for another season of \"The Apprentice: White House Edition.\""
    ]
  },
  {
    "sourceName": "TMZ",
    "title": "Becky G, Sebastian Lletget Still Going Strong Despite Cheating Drama - TMZ",
    "url": "https://www.tmz.com/2024/03/04/becky-g-sebastian-lletget-relationship-cheating-rumors/",
    "urlToImage": "https://imagez.tmz.com/image/67/16by9/2024/02/27/672edf6c2e6d421f9ea23389c801a128_xl.jpg",
    "publishedAt": "2024-03-04T09:00:00Z",
    "description": "Becky G and Sebastian Lletget are looking awfully cozy and coupled up in Frisco, TX  ... despite dealing with cheating drama last year.",
    "author": "TMZ Staff",
    "content": "Becky Gand Sebastian Lletgetare looking awfully cozy and coupled up in Frisco, TX  ... despite dealing with cheating drama last year.\r\nAll signs point to them still going strong, based on these image… [+1144 chars]",
    "jokes": [
      "\"So, Becky G and Sebastian Lletget are still together despite last year's cheating drama. It's good to know that even in relationships, some people can still believe in 'second chances', or in their case 'second glances'.\""
    ]
  },
  {
    "sourceName": "CNN",
    "title": "Crews battling massive Texas wildfires get a crucial opportunity to contain flames as cool air and gentler winds arrive Monday - CNN",
    "url": "https://www.cnn.com/2024/03/03/us/texas-smokehouse-creek-wildfire-monday/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/240302171218-tx-cattle-fire-thumb-1.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-04T08:53:00Z",
    "description": "Firefighters racing to wrangle the largest blaze in Texas history could get their best chance in days to contain the flames as a cold front sweeps into the region Monday where hot air and raging winds have fueled the infernos reducing entire neighborhoods to …",
    "author": "Elizabeth Wolfe",
    "content": "Firefighters racing to wrangle the largest blaze in Texas history could get their best chance in days to contain the flames as a cold front sweeps into the region Monday where hot air and raging wind… [+5899 chars]",
    "jokes": [
      "You know things are getting tough when Texas is relying on a cold front to put out wildfires. It's the only time you'll hear a Texan say \"Thank God for the cold!\""
    ]
  },
  {
    "sourceName": "The Times of India",
    "title": "Colon cancer in younger people: Keep an eye out for 5 important indicators - The Times of India",
    "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/colon-cancer-in-younger-people-keep-an-eye-out-for-5-important-indicators/articleshow/108201032.cms",
    "urlToImage": "https://static.toiimg.com/thumb/msid-108200966,width-1070,height-580,imgsize-1307574,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "publishedAt": "2024-03-04T08:30:00Z",
    "description": "Colon cancer is increasingly affecting young people due to poor lifestyle choices. Early detection is crucial for effective treatment. Symptoms may in",
    "author": "TOI Lifestyle Desk",
    "content": null,
    "jokes": [
      "You know, The Times of India just reported that we should keep an eye out for 5 important indicators of colon cancer. I mean, isn't it enough that we have to track our steps, calories, screen time, and now our bowel movements too?"
    ]
  },
  {
    "sourceName": "CNN",
    "title": "Japan’s Nikkei 225 surpasses 40,000 for the first time while China gets ready to unveil GDP target - CNN",
    "url": "https://www.cnn.com/2024/03/04/business/japans-nikkei-surpasses-40000-china-stocks-npc-intl-hnk/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2049067705.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-04T07:43:00Z",
    "description": "Japan’s Nikkei 225 index jumped above 40,000 points for the first time on Monday, extending a historic rally that analysts say may have much further to run.e.",
    "author": "Laura He",
    "content": "Asian markets have started the week on an upbeat note.\r\nJapans Nikkei 225 index jumped above 40,000 points for the first time on Monday, extending a historic rally that analysts say may have much fur… [+2999 chars]",
    "jokes": [
      "Well, folks, Japan’s Nikkei 225 just surpassed 40,000 for the first time. At this rate, the only thing rising faster is the price of my morning coffee!"
    ]
  },
  {
    "sourceName": "CNN",
    "title": "‘Two sessions’: China scraps a decades-long political tradition as Xi tightens control amid economic woes - CNN",
    "url": "https://www.cnn.com/2024/03/04/china/china-two-sessions-xi-jinping-economic-challenges-intl-hnk/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1435758127.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-04T07:35:00Z",
    "description": "Thousands of delegates from across China are gathering in Beijing this week for the start of the country’s most prominent annual political event, where leaders will signal how they plan to steer the world’s second largest economy in the year ahead — and try t…",
    "author": "Simone McCarthy",
    "content": "Editors Note: Sign up for CNNs Meanwhile in China newsletter which explores what you need to know about the countrys rise and how it impacts the world.\r\nThousands of delegates from across China are g… [+9046 chars]",
    "jokes": [
      "\"So China is scrapping a decades-long political tradition, just when I decided to finally understand it. Guess Xi Jinping wanted to save me from another New Year's resolution failure!\""
    ]
  },
  {
    "sourceName": "ESPN",
    "title": "Eagles' Jason Kelce announces retirement after 13 seasons - ESPN",
    "url": "https://www.espn.com/nfl/story/_/id/39653213/eagles-jason-kelce-announces-retirement-13-seasons",
    "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0116%2Fr1278161_1296x729_16%2D9.jpg",
    "publishedAt": "2024-03-04T18:05:00Z",
    "description": "The Eagles' Jason Kelce, the only center since 1970 to have won a Super Bowl and been named first-team All-Pro six times, has retired after 13 seasons.",
    "author": "Tim McManus",
    "content": "PHILADELPHIA -- Eagles star center Jason Kelce, one of the key leaders for a team that has made six postseason appearances and two Super Bowl trips over the past seven seasons, announced his retireme… [+3988 chars]",
    "jokes": [
      "Jason Kelce announced his retirement after 13 seasons, probably because he realized he's spent more time in the field than a scarecrow. But seriously, with all those postseason appearances and Super Bowl trips, the man's seen more bowls than a cereal fanatic!"
    ]
  },
  {
    "sourceName": "The Washington Post",
    "title": "Indian police arrest 3 in rape of Brazilian tourist on motorcycle trip - The Washington Post",
    "url": "https://www.washingtonpost.com/world/2024/03/04/india-rape-brazilian-tourist-jharkhand/",
    "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FD6NPLURQQ7WBXNUK7T6SXSXLU.jpg&w=1440",
    "publishedAt": "2024-03-04T18:04:21Z",
    "description": "While rape against Indian women is common, this incident involving a foreigner — a Brazilian blogger who went public — focused national attention to an unusual degree.",
    "author": "Anant Gupta",
    "content": "NEW DELHI Police in eastern India say they have arrested three men and are pursuing four others in the gang rape of a Brazilian tourist, a case that has drawn cries of fury and shame from those in In… [+4218 chars]",
    "jokes": [
      "\"In eastern India, three men have been arrested for the rape of a Brazilian tourist, which is a real shocker because, let's be honest, isn't it usually the other way around with tourists committing crimes? I mean, the last time I checked, stealing hotel towels was still considered a crime.\""
    ]
  },
  {
    "sourceName": "BBC News",
    "title": "France makes abortion constitutional right - BBC.com",
    "url": "https://www.bbc.com/news/world-europe-68471568",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/3B9F/production/_132836251_gettyimages-2050974621.jpg",
    "publishedAt": "2024-03-04T18:02:04Z",
    "description": "France becomes the first country in the world to include the right to terminate a pregnancy in its constitution.",
    "author": null,
    "content": "The Eiffel Tower lit up with the message \"My body My choice\" after the vote\r\nFrance has become the first country in the world to include the right to abortion in its constitution.\r\nParliamentarians v… [+2697 chars]",
    "jokes": [
      "So France just made abortion a constitutional right. In other news, baguettes across the country were heard saying, \"Finally, we're not the only things getting the 'cut' around here!\""
    ]
  },
  {
    "sourceName": "WDIV ClickOnDetroit",
    "title": "Why I don't expect James Crumbley's trial to simply be a replay of his wife's - WDIV ClickOnDetroit",
    "url": "https://www.clickondetroit.com/news/local/2024/03/04/why-i-dont-expect-james-crumbleys-trial-to-be-a-replay-of-his-wifes/",
    "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/TDY3M42K2RCENLYECWGDKQBWXQ.jpg?_a=ATAPphC0",
    "publishedAt": "2024-03-04T18:02:02Z",
    "description": "It’s been about a month since the trial for the mother of the Oxford High School shooter, and now, we’re about to do it all over again for his father. But don’t expect James Crumbley’s trial to simply be a replay of his wife’s.",
    "author": "Derick Hutchinson",
    "content": "OXFORD, Mich. Its been about a month since the trial for the mother of the Oxford High School shooter, and now, were about to do it all over again for his father. But dont expect James Crumbleys tria… [+6509 chars]",
    "jokes": [
      "So, we're about to have another trial for the father of the Oxford High School shooter. It's like a series sequel nobody asked for - \"Law & Order: Parental Control.\""
    ]
  },
  {
    "sourceName": "NBCSports.com",
    "title": "Mike Evans contract shows the value of tampering - NBC Sports",
    "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/mike-evans-contract-shows-the-value-of-tampering",
    "urlToImage": "https://nbcsports.brightspotcdn.com/dims4/default/30cb9f7/2147483647/strip/true/crop/4459x2508+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff8%2Fc5%2Fdd32d7d843e3854c71c0e8ff5de0%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F1954100236",
    "publishedAt": "2024-03-04T16:54:58Z",
    "description": "Scouting Combine is Tampering Central.",
    "author": "Mike Florio",
    "content": "Scouting Combine is Tampering Central. For some teams that hope to keep an impending free agent, that can complicate things. For other teams, it can be a good thing.\r\nFor the Buccaneers, tampering mi… [+860 chars]",
    "jokes": [
      "You know, I read today that Mike Evans' contract shows the value of tampering. It's funny because, in my day, the only \"tampering\" we did was trying to fix the antenna on the old TV to catch the game!"
    ]
  },
  {
    "sourceName": "Deadline",
    "title": "‘Dune: Part Two’ Mines More Moola: Domestic Opening Weekend At $82.5M – Box Office - Deadline",
    "url": "http://deadline.com/2024/03/dune-part-two-box-office-opening-1235844857/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/02/rev-1-DUN2-T2-0083r_High_Res_JPEG.jpeg?w=1024",
    "publishedAt": "2024-03-04T16:41:00Z",
    "description": "Legendary Entertainment/Warner Bros.’ Dune: Part Two came in higher with an $82.5M opening. That’s all thanks to a higher than anticipated Sunday of $21.65M versus $20.3M. Presales, I hear in Imax remain strong into next weekend as some moviegoers want to sid…",
    "author": "Anthony D'Alessandro",
    "content": "Legendary Entertainment/Warner Bros.’ Dune: Part Twocame in higher with an $82.5M opening. That’s all thanks to a higher than anticipated Sunday of $21.65M versus $20.3M. \r\nPresales, I hear in Imax r… [+1347 chars]",
    "jokes": [
      "You know, 'Dune: Part Two' had a whopping $82.5M opening. At this rate, the only sandstorm they'll need to worry about is the one caused by all the money they're raking in!"
    ]
  },
  {
    "sourceName": "Yahoo Entertainment",
    "title": "JetBlue, Spirit Airlines call off $3.8 billion merger on antitrust hurdle - Yahoo Finance",
    "url": "https://finance.yahoo.com/news/jetblue-terminates-3-8-billion-133729135.html",
    "urlToImage": "https://media.zenfs.com/en/reuters-finance.com/738bc097bb963b77828e96edd5d9df1b",
    "publishedAt": "2024-03-04T16:26:39Z",
    "description": "WASHINGTON (Reuters) -Low-cost air carriers JetBlue Airways and Spirit Airlines canceled their $3.8-billion merger agreement on Monday, seeing no path...",
    "author": "David Shepardson and Aatreyee Dasgupta",
    "content": "By David Shepardson and Aatreyee Dasgupta\r\nWASHINGTON (Reuters) -Low-cost air carriers JetBlue Airways and Spirit Airlines canceled their $3.8-billion merger agreement on Monday, seeing no path forwa… [+3531 chars]",
    "jokes": [
      "\"So, JetBlue and Spirit Airlines called off their $3.8 billion merger due to antitrust issues. I guess you could say their relationship never really 'took off'.\""
    ]
  },
  {
    "sourceName": "NFL News",
    "title": "2024 NFL free agency tracker: Latest signings, trades, contract info for all 32 teams - NFL.com",
    "url": "https://www.nfl.com/news/2024-nfl-free-agency-tracker-latest-signings-trades-contract-info-for-all-32-teams",
    "urlToImage": "https://static.www.nfl.com/image/upload/t_editorial_landscape_12_desktop/league/cehsiukubygoyvq0fke6",
    "publishedAt": "2024-03-04T16:22:00Z",
    "description": "The grand reshuffling of NFL rosters is upon us. So ... who's going where? NFL.com's 2024 free agency tracker provides real-time team-by-team updates of all the key additions and trades in this frenzied period.",
    "author": null,
    "content": null,
    "jokes": [
      "I see the 2024 NFL free agency tracker is out. It's the perfect tool for anyone wanting to know where their favorite player is going, or for my wife, who uses it to track where all the good looking quarterbacks are."
    ]
  },
  {
    "sourceName": "CNBC",
    "title": "Ukraine war live updates: Russia ramps up the rhetoric over Moldova, saying West wants to control it; Kremlin slams German military leak - CNBC",
    "url": "https://www.cnbc.com/2024/03/04/ukraine-war-live-updates-latest-news-on-russia-and-the-war-in-ukraine.html",
    "urlToImage": "https://image.cnbcfm.com/api/v1/image/107381640-1709553092973-gettyimages-931010570-AFP_12E639.jpeg?v=1709553118&w=1920&h=1080",
    "publishedAt": "2024-03-04T15:57:00Z",
    "description": "A war of words erupted between Russia and Germany over a leaked audio recording purportedly of German military officials discussing possible Russian targets.",
    "author": "Holly Ellyatt",
    "content": "Germany's defense minister said on Sunday Russia was conducting an \"information war\" aimed at creating divisions within Germany, his first reaction to the publication in Russia of an audio recording … [+1351 chars]",
    "jokes": [
      "You know, Russia's been accused of starting an \"information war\" with Germany - they're spreading so many rumors, they might as well start their own tabloid. At this rate, we'll have \"Kremlin Weekly\" next to our supermarket checkouts."
    ]
  },
  {
    "sourceName": "CNBC",
    "title": "Ford sales jump 10.5% in February, led by gains in hybrids and EVs - CNBC",
    "url": "https://www.cnbc.com/2024/03/04/ford-february-sales-hybrids-evs.html",
    "urlToImage": "https://image.cnbcfm.com/api/v1/image/107381824-1709567418914-107381824-1709567342381-gettyimages-1235117579-20090101210908-99-136832.jpg?v=1709567428&w=1920&h=1080",
    "publishedAt": "2024-03-04T15:34:07Z",
    "description": "Ford Motor's U.S. sales jumped 10.5% last month compared to February 2023, led by increases in its hybrid and all-electric vehicles sales.",
    "author": "Michael Wayland",
    "content": "DETROIT Ford Motor's U.S. sales jumped 10.5% last month compared with February 2023, led by increases in its hybrid and all-electric vehicles sales.\r\nThe Detroit automaker Monday reported sales of 17… [+1562 chars]",
    "jokes": [
      "Ford's sales jumped 10.5% last month, mostly in hybrids and EVs. Apparently, people got tired of their cars running on gas and started preferring the ones running on their leftover Tesla stock profits!"
    ]
  },
  {
    "sourceName": "Associated Press",
    "title": "Thousands escape from Haitian prisons after gangs overrun them - The Associated Press",
    "url": "https://apnews.com/article/haiti-violence-prison-break-curfew-105ca137aa337b9e6681cf87add9a5c1",
    "urlToImage": "https://dims.apnews.com/dims4/default/e8402d0/2147483647/strip/true/crop/6014x3383+0+416/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Ff8%2F60f5d84a6233bc9197b01a78cfe9%2F2e5bee71b4664d1f82a0772ddefc5059",
    "publishedAt": "2024-03-04T15:26:00Z",
    "description": "Authorities in Haiti have ordered a nighttime curfew after an explosion of violence as gang gunmen overran the two biggest prisons and freed thousands of inmates over the weekend. Gangs already were estimated to control up to 80% of Port-au-Prince, the capita…",
    "author": "EVENS SANON, PIERRE-RICHARD LUXAMA",
    "content": "PORT-AU-PRINCE, Haiti (AP) Authorities in Haiti have ordered a nighttime curfew after an explosion of violence when gang gunmen overran the two biggest prisons and freed thousands of inmates over the… [+3857 chars]",
    "jokes": [
      "Wow, thousands escaped from Haitian prisons after gangs took over - it's like the world's most dangerous game of hide-and-seek. It's so bad, even the rats are applying for parole!"
    ]
  },
  {
    "sourceName": "CBS News",
    "title": "One of the world's most populated cities is nearly out of water as many go \"days if not weeks\" without it - CBS News",
    "url": "https://www.cbsnews.com/news/mexico-city-nearly-out-of-water-many-go-days-if-not-weeks-without-it/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/03/04/874fff26-69d2-4f16-bdf3-db0e2161fd2f/thumbnail/1200x630/681e701489ea292c82482ba9ead471a4/gettyimages-2037897310.jpg?v=1e8ff12f47c38c5019c2d633717919f8",
    "publishedAt": "2024-03-04T15:19:57Z",
    "description": "The director of Mexico City's water system says the region is facing an \"unprecedented situation.\"",
    "author": "Li Cohen",
    "content": "Mexico City is home to nearly 22 million people. But for months, the sprawling city has been suffering from diminishing water supplies — and now, one of the world's most populated cities is on the ve… [+4055 chars]",
    "jokes": [
      "\"Mexico City is running out of water - citizens are going 'days if not weeks' without it. At this point, even a mirage of a Starbucks on every corner sounds pretty refreshing!\""
    ]
  },
  {
    "sourceName": "WOODTV.com",
    "title": "Second measles case reported in Michigan - WOODTV.com",
    "url": "https://www.woodtv.com/news/michigan/second-measles-case-reported-in-michigan/",
    "urlToImage": "https://www.woodtv.com/wp-content/uploads/sites/51/2019/05/measles-cdc-generic_1521045480047_37160515_ver1.0.jpg?w=1280",
    "publishedAt": "2024-03-04T15:17:10Z",
    "description": "Less than two weeks after reporting its first measles case in five years, Michigan now has a second active case.",
    "author": "Matt Jaworowski",
    "content": "GRAND RAPIDS, Mich. (WOOD) Less than two weeks after reporting its first measles case in five years, Michigan now has a second active case.\r\nThe Washtenaw County Health Department announced Sunday th… [+2822 chars]",
    "jokes": [
      "\"Michigan has reported its second case of measles in less than two weeks. The only thing spreading faster than this in Michigan is the rumor that Detroit Lions might actually win a game this season!\""
    ]
  },
  {
    "sourceName": "Ars Technica",
    "title": "Blue Origin is getting serious about developing a human spacecraft - Ars Technica",
    "url": "https://arstechnica.com/space/2024/03/blue-origin-staffing-up-to-build-a-human-spacecraft/",
    "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/02/429312040_335507396152650_4562218543835705457_n-760x380.jpg",
    "publishedAt": "2024-03-04T15:10:36Z",
    "description": "Company seeks: \"Experience with human spaceflight or high-performance aircraft systems?\"",
    "author": "Eric Berger",
    "content": "Enlarge/ Dave Limp, Blue Origin's new CEO, and founder Jeff Bezos observe the New Glenn rocket on its launch pad Wednesday at Cape Canaveral Space Force Station, Florida.\r\n40\r\nThe space company named… [+4319 chars]",
    "jokes": [
      "So, Blue Origin is gearing up to develop a human spacecraft, huh? I guess after Amazon, Jeff Bezos just can't resist the urge to ship humans now!"
    ]
  },
  {
    "sourceName": "CNBC",
    "title": "Some NYCB deposits may be a flight risk after Moody’s downgrades ratings again - CNBC",
    "url": "https://www.cnbc.com/2024/03/04/some-nycb-deposits-may-be-at-risk-after-another-moodys-downgrade.html",
    "urlToImage": "https://image.cnbcfm.com/api/v1/image/107370521-17073441702024-02-07t011117z_181388254_rc25t5a5jhqn_rtrmadp_0_ny-cmnty-bancp-moody-s.jpeg?v=1707344314&w=1920&h=1080",
    "publishedAt": "2024-03-04T20:24:27Z",
    "description": "Moody's slashed one of New York Community Bank's key ratings for the second time in a month.",
    "author": "Hugh Son",
    "content": "Regional lender New York Community Bank may have to pay more to retain deposits after one of the company's key ratings was slashed for the second time in a month.\r\nLate Friday, Moody's Investors Serv… [+2961 chars]",
    "jokes": [
      "\"You know things are bad when even your bank's money wants to leave New York. I mean, at this rate, it's going to be paying its deposits in Broadway tickets and hot dogs just to get them to stay!\""
    ]
  },
  {
    "sourceName": "CNN",
    "title": "France becomes world’s first country to enshrine abortion rights in constitution - CNN",
    "url": "https://www.cnn.com/2024/03/04/europe/france-abortion-constitution-intl/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2039806910.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-04T19:45:00Z",
    "description": "The historic decision is the culmination of an effort that began in direct response to the US Supreme Court’s decision to overturn Roe v. Wade.",
    "author": "Joshua Berlinger, Xiaofei Xu",
    "content": "France became the worlds first countryto enshrine abortion rights in its constitution on Monday, the culmination of an effort that began in direct response to the US Supreme Courts decision to overtu… [+3416 chars]",
    "jokes": [
      "\"So, France has become the world's first country to enshrine abortion rights in its constitution. You know, that's the most French thing I've heard...they're always one-upping us - we give the world McDonald's, they give us gourmet cuisine; we question abortion rights, they put it in their constitution!\""
    ]
  },
  {
    "sourceName": "Fox News",
    "title": "Protest of CDC’s new COVID guidance planned for this month in Washington, DC: ‘Urgent need’ - Fox News",
    "url": "https://www.foxnews.com/health/protest-cdcs-covid-guidance-planned-washington-dc-urgent-need",
    "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/03/lincoln-memorial.jpg",
    "publishedAt": "2024-03-04T19:30:00Z",
    "description": "A community of \"long COVID\" activists has planned a march in Washington, D.C., to protest a recent announcement from the CDC. One of the organizers speaks to Fox News Digital about the event.",
    "author": "Melissa Rudy",
    "content": "Join Fox News for access to this content\r\nPlus special access to select articles and other premium content with your account - free of charge.\r\nPlease enter a valid email address.\r\nBy entering your e… [+6300 chars]",
    "jokes": [
      "So there's a protest planned in Washington DC over the CDC's new COVID guidance. I guess some people just miss the thrill of hoarding toilet paper and baking sourdough bread."
    ]
  },
  {
    "sourceName": "Associated Press",
    "title": "UN envoy says 'reasonable grounds' to believe Hamas committed sexual violence on Oct. 7 - The Associated Press",
    "url": "https://apnews.com/article/israel-palestinians-un-rape-oct7-hamas-gaza-fe1a35767a63666fe4dc1c97e397177e",
    "urlToImage": "https://dims.apnews.com/dims4/default/9c0e66e/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fc8%2F9d06bfd12571a2f993def7d6bdcb%2F338295857d3c4a05864a0ed94953c01a",
    "publishedAt": "2024-03-04T19:24:22Z",
    "description": "The U.N. envoy focusing on sexual violence in conflict says there are “reasonable grounds” to believe Hamas committed rape, “sexualized torture,” and other cruel and inhuman treatment of women during its surprise attack in southern Israel on Oct. 7 that left …",
    "author": "EDITH M. LEDERER",
    "content": "UNITED NATIONS (AP) The U.N. envoy focusing on sexual violence in conflict said in a new report Monday that there are reasonable grounds to believe Hamas committed rape, sexualized torture, and other… [+3365 chars]",
    "jokes": [
      "\"So, the UN envoy says there's 'reasonable grounds' to believe Hamas committed sexual violence. I guess when they said they were going to 'blow up' the Middle East, they meant it in more ways than one!\""
    ]
  },
  {
    "sourceName": "CNN",
    "title": "Supreme Court keeps Trump on Colorado ballot, rejecting 14th Amendment push - CNN",
    "url": "https://www.cnn.com/2024/03/04/politics/trump-supreme-court-colorado-14th-amendment/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1995694336-20240304014552715.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-04T19:22:00Z",
    "description": "The Supreme Court ruled Monday that former President Donald Trump should appear on the ballot in Colorado in a decision that follows months of debate over whether the frontrunner for the GOP nomination violated the “insurrectionist clause” included in the 14t…",
    "author": "John Fritze, Devan Cole, Marshall Cohen",
    "content": "The Supreme Court ruled Monday that former President Donald Trump should appear on the ballot in Colorado in a decision that follows months of debate over whether the frontrunner for the GOP nominati… [+8359 chars]",
    "jokes": [
      "\"So, the Supreme Court ruled that Trump's name should appear on the Colorado ballot. I guess it's the closest he'll ever get to being 'high' in office again!\""
    ]
  },
  {
    "sourceName": "BBC News",
    "title": "Caitlin Clark saluted by LeBron James for breaking college basketball record - BBC.com",
    "url": "https://www.bbc.com/news/world-us-canada-68468912",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/16209/production/_132833609_gettyimages-2049061659.jpg",
    "publishedAt": "2024-03-04T19:07:17Z",
    "description": "With 3,685 points, Ms Clark became the all-time leading scorer in men's and women's college basketball.",
    "author": null,
    "content": "Ms Clark has broken several records in her time as an Iowa Hawkeyes player\r\nWomen's basketball star Caitlin Clark earned praise from President Joe Biden and LeBron James after she became the NCAA's a… [+2077 chars]",
    "jokes": [
      "Wow, Caitlin Clark is breaking basketball records and getting praised by LeBron James and President Biden. At this rate, she'll be dunking on the national debt and assisting in foreign policy by next week!"
    ]
  },
  {
    "sourceName": "Engadget",
    "title": "Pixel phones just got next-gen call screening - Engadget",
    "url": "https://www.engadget.com/pixel-phones-just-got-next-gen-call-screening-190034396.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/psaO7KbjrnAq5ioixCCD3Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/4ad41870-d7f4-11ee-bcba-8744e7682299",
    "publishedAt": "2024-03-04T19:00:34Z",
    "description": "Google just rolled out next-gen call screening to some Pixel phone models. This tool employs Google Assistant to find out why the person on the other end...",
    "author": "Lawrence Bonk",
    "content": "Google just announced that some Pixel phones are getting next-gen call screening. This improves on the pre-existing Call Screen feature by implementing a new Hello button. Once tapped, the system wil… [+1353 chars]",
    "jokes": [
      "\"Google just announced next-gen call screening for Pixel phones. I guess they finally found a way to avoid my mom's calls asking how to use her email!\""
    ]
  },
  {
    "sourceName": "MacRumors",
    "title": "M3 MacBook Pro to Get Multi-Display Support With Software Update - MacRumors",
    "url": "https://www.macrumors.com/2024/03/04/m3-macbook-pro-multi-display-support/",
    "urlToImage": "https://images.macrumors.com/t/oJJ29_JDaeK4p98oIB-4rkIiPs8=/2500x/article-new/2023/10/m3-macbook-pro-blue.jpg",
    "publishedAt": "2024-03-04T18:47:40Z",
    "description": "Apple is planning a software update that will add multi-display support to the 14-inch M3 MacBook Pro model, the company confirmed to 9to5Mac. The M3...",
    "author": "Juli Clover",
    "content": "Apple is planning a software update that will add multi-display support to the 14-inch M3 MacBook Pro model, the company confirmed to 9to5Mac. The M3 MacBook Air models that were introduced today inc… [+1179 chars]",
    "jokes": [
      "\"So, Apple is planning a software update to add multi-display support to the M3 MacBook Pro. Now you can have multiple screens to remind you that you still can't afford it!\""
    ]
  },
  {
    "sourceName": "Associated Press",
    "title": "Influx of firefighters, cooler weather in Texas Panhandle helps keep wildfires in check - The Associated Press",
    "url": "https://apnews.com/article/texas-wildfire-panhandle-hutchinson-united-way-donations-d61f26c6686ae62e855bd2075453651b",
    "urlToImage": "https://dims.apnews.com/dims4/default/5358dc1/2147483647/strip/true/crop/1745x982+0+93/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2Faa%2Fb4af2d42dc11c0dfbf95b772c740%2F26c88d99279e47729069eb17e53516cc",
    "publishedAt": "2024-03-04T18:46:00Z",
    "description": "An influx of hundreds of firefighters and more favorable weather conditions are helping authorities in the Texas Panhandle keep the largest wildfire in state history from threatening more homes and communities. A cluster of fires has burned across more than 1…",
    "author": "VALERIE GONZALEZ",
    "content": "McALLEN, Texas (AP) An influx of hundreds of firefighters and more favorable weather conditions on Monday helped authorities in the Texas Panhandle keep the largest wildfire in state history from thr… [+3798 chars]",
    "jokes": [
      "Even wildfires in Texas are like, \"Man, it's too hot to spread around here!\" So I guess even Mother Nature likes to mess with Texas!"
    ]
  },
  {
    "sourceName": "ABC News",
    "title": "Pentagon leaker Jack Teixeira agrees to accept 16-year prison sentence - ABC News",
    "url": "https://abcnews.go.com/US/pentagon-leak-suspect-jack-teixeira-agrees-accept-16/story?id=107772933",
    "urlToImage": "https://i.abcnewsfe.com/a/0b9b6782-b91e-4abc-bc3e-5dcc017d5a2e/Jack-Teixeira-rt-jm-240304_1709564827728_hpMain_16x9.jpg?w=1600",
    "publishedAt": "2024-03-04T18:45:00Z",
    "description": "Teixeira, 22, agreed to plead guilty to all six counts against him.",
    "author": "Aaron Katersky",
    "content": "Massachusetts Air National Guardsman Jack Teixeira agreed Monday that he caused one of the most extraordinary leaks of national defense secrets in years and agreed to accept a prison sentence of 16 y… [+5646 chars]",
    "jokes": [
      "Well, in the news today, Pentagon leaker Jack Teixeira agreed to a 16-year prison sentence. I guess when they told him he could work from home, he really took \"taking your work home\" to another level!"
    ]
  },
  {
    "sourceName": "San Francisco Chronicle",
    "title": "How California's snowpack has changed after massive storm - San Francisco Chronicle",
    "url": "https://www.sfchronicle.com/weather/article/california-snow-totals-18703088.php",
    "urlToImage": "https://s.hdnux.com/photos/01/36/41/42/24778941/3/rawImage.jpg",
    "publishedAt": "2024-03-04T18:00:21Z",
    "description": "Cailfornia's snowpack has jumped to above normal levels after the weekend blizzard. It's a dramatic turnaround from just two months ago.",
    "author": "Anthony Edwards, Kate Galbraith",
    "content": "A man skis with his dog as heavy snow falls in South Lake Tahoe on Sunday. Snow totals across the Sierra soared after the storm.\r\nNoah Berger/Special to the Chronicle\r\nAfter a multi-day blizzard drop… [+2857 chars]",
    "jokes": [
      "\"So, California's snowpack has changed after a massive storm. At this rate, people in Los Angeles will start trading their surfboards for snowboards!\""
    ]
  },
  {
    "sourceName": "The Athletic",
    "title": "NFL Scouting Combine takeaways: Michael Penix and the QBs, a loaded WR class and more - The Athletic",
    "url": "https://theathletic.com/5314788/2024/03/04/nfl-scouting-combine-takeaways-quarterbacks/",
    "urlToImage": "https://cdn.theathletic.com/app/uploads/2024/03/04085842/0304_CombineTakeaways.jpg",
    "publishedAt": "2024-03-04T17:50:28Z",
    "description": "What did we learn from the NFL Scouting Combine and who stood out? Let's break down what we heard.",
    "author": "Bruce Feldman",
    "content": "The draft process is always fascinating, but when you have this deep of a quarterback crop, thats when things get juicy. I have never been this curious to see how things unfold as I am with this quar… [+10167 chars]",
    "jokes": [
      "You know, the NFL Scouting Combine is saying they have a deep quarterback crop this year. It's so deep, they're considering renaming it to the Mariana Trench of Quarterbacks!"
    ]
  },
  {
    "sourceName": "CoinDesk",
    "title": "Bitcoin Price Action Will 'Astonish' This Week: Analyst - CoinDesk",
    "url": "https://www.coindesk.com/markets/2024/03/04/bitcoin-price-action-will-astonish-this-week-analyst/",
    "urlToImage": "https://www.coindesk.com/resizer/fy8XJUNcAkEZfeLqPf9tyXPSMUE=/1200x628/center/middle/cloudfront-us-east-1.images.arcpublishing.com/coindesk/F4AMMZ26WFCCPGGNTZ3C7QKMFI.jpg",
    "publishedAt": "2024-03-04T17:46:00Z",
    "description": "The cryptocurrency hit an all-time high against the euro on Monday and is nearing a record in U.S. dollar terms.",
    "author": "Lyllah Ledesma",
    "content": "Bitcoin (BTC) will reach an all-time high before the week ends, according to Markus Thielen, head of research at 10x.\r\nPrice action during the weekend is always important to follow and while attempts… [+1455 chars]",
    "jokes": [
      "\"So, Bitcoin is predicted to reach an all-time high this week, according to some analysts. I guess I should've listened when my mother said to invest in Bitcoin, not in my stand-up comedy career!\""
    ]
  },
  {
    "sourceName": "Variety",
    "title": "‘Dune 2’ Box Office: 5 Takeaways From the Sequel’s Heroic Opening Weekend - Variety",
    "url": "https://variety.com/2024/film/news/dune-2-box-office-analysis-opening-weekend-timothee-chalamet-1235928762/",
    "urlToImage": "https://variety.com/wp-content/uploads/2024/02/dune-6.jpg?w=1000&h=563&crop=1",
    "publishedAt": "2024-03-04T17:46:00Z",
    "description": "Here are five takeaways from \"Dune: Part Two's\" mighty box office debut.",
    "author": "Rebecca Rubin",
    "content": "Not even the prophetic visions of Timothée Chalamet’s Paul Atreides, the messianic protagonist of “Dune,” could have predicted the commercial appeal of director Denis Villeneuve’s ambitious interplan… [+7236 chars]",
    "jokes": [
      "\"So, 'Dune 2' had a heroic opening weekend at the box office. Surprisingly, the only thing faster than a sandworm in the desert was fans racing to the theater to see Timothée Chalamet's hair in IMAX!\""
    ]
  },
  {
    "sourceName": "KABC-TV",
    "title": "Texas-based company claims to have new evidence in search for missing Malaysia Airlines Flight MH370 - KABC-TV",
    "url": "https://abc7.com/malaysia-airlines-flight-mh370-missing-plane-ocean-infinity-370/14490516/",
    "urlToImage": "https://cdn.abcotvs.com/dip/images/14490547_030424-wpvi-n1-mh-370-search-pkg-video-vid.jpg?w=1600",
    "publishedAt": "2024-03-04T17:38:24Z",
    "description": "It's been nearly 10 years to the day since Malaysia Airlines Flight MH370 disappeared from radar and is believed to have plunged into the Indian Ocean.",
    "author": null,
    "content": "There is new hope in the disappearance of the Malaysia Airlines flight that vanished 10 years ago.\r\nThe Texas-based company, Ocean Infinity, claims to have scientific evidence of the plane's final re… [+1403 chars]",
    "jokes": [
      "A Texas-based company claims to have new evidence in the search for the missing Malaysia Airlines Flight MH370. Yeah, they sent a text to the plane and it just now delivered."
    ]
  },
  {
    "sourceName": "Fox News",
    "title": "Democratic lawyer taunting Trump's 'tough jury pool' in DC sparks backlash from right on social media - Fox News",
    "url": "https://www.foxnews.com/media/democratic-lawyer-taunting-trumps-tough-jury-pool-dc-sparks-backlash-right-social-media",
    "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/AP24011073565402.jpg",
    "publishedAt": "2024-03-04T17:30:00Z",
    "description": "Democratic lawyer Marc Elias was criticized after mocking former President Trump's ability to get a fair trial in Washington D.C. after losing the GOP primary in the district.",
    "author": "Kristine Parks",
    "content": "Top Democratic lawyer Marc Elias sparked fierce reaction on Sunday for appearing to taunt former President Trump's ability to get a fair trial in Washington, D.C. following his primary loss in the di… [+3244 chars]",
    "jokes": [
      "\"Well, Trump's worried about getting a fair trial in Washington, D.C... I guess he forgot that's not how reality shows work!\" \"I mean, come on, the only jury pool Trump wants to dive into is the one at Mar-a-Lago!\""
    ]
  },
  {
    "sourceName": "Engadget",
    "title": "Samsung's Galaxy S24 phones are up to $150 off at Amazon and Best Buy - Engadget",
    "url": "https://www.engadget.com/samsungs-galaxy-s24-phones-are-up-to-150-off-at-amazon-and-best-buy-164520013.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/BjHifshRK.0KUogsU_Hz.A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MjA-/https://s.yimg.com/os/creatr-uploaded-images/2024-01/8918c140-bed0-11ee-9bf6-8a3e196f28ea",
    "publishedAt": "2024-03-04T16:45:20Z",
    "description": "Samsung's Galaxy S24 smartphones are up to $150 at Amazon and Best Buy after new sales.",
    "author": "Jeff Dunn",
    "content": "Both Amazon and Best Buy have kicked off new sales on Samsung's Galaxy S24 lineup, taking up to $150 off the unlocked versions of the recently released smartphones. The 6.8-inch Galaxy S24 Ultra and … [+2248 chars]",
    "jokes": [
      "\"Samsung's Galaxy S24 phones are now up to $150 off at Amazon and Best Buy, so now you can finally afford to lose them in your couch cushions. Seems like the only difference between this and the S23 model is that the S24 is easier to misplace!\""
    ]
  },
  {
    "sourceName": "The Hill",
    "title": "California Democratic primary: Live results - The Hill",
    "url": "https://thehill.com/homenews/campaign/4507628-california-democratic-primary-live-results/",
    "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/02/Politics-Biden_022824_AP_Andrew-Harnik.jpg?w=1280",
    "publishedAt": "2024-03-05T22:08:00Z",
    "description": "Voters are heading out to the polls to vote in the Democratic primary in California on Super Tuesday. President Biden, Rep. Dean Phillips (Minn.) and author Marianne Williamson are competing for the nomination, while voters will also have an option to vote “u…",
    "author": "The Hill",
    "content": "Voters are heading out to the polls to vote in the Democratic primary in California on Super Tuesday.\r\nPresident Biden, Rep. Dean Phillips (Minn.) and author Marianne Williamson are competing for the… [+382 chars]",
    "jokes": [
      "\"So, Californians are hitting the polls on Super Tuesday, choosing between Biden, Phillips, and author Marianne Williamson. It's like deciding between a night of Netflix, doing your taxes, or reading a self-help book - all necessary, but not exactly the party you were hoping for.\""
    ]
  },
  {
    "sourceName": "Yahoo Entertainment",
    "title": "NFL franchise tag deadline: Josh Allen, Michael Pittman Jr. among players placed on it - Yahoo Sports",
    "url": "https://sports.yahoo.com/nfl-franchise-tag-deadline-josh-allen-michael-pittman-jr-among-players-placed-on-it-210148815.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/TmUhjjAldPfsmcj55PHiIw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-02/f0257f50-db2b-11ee-bcfc-ec95ececf0e1",
    "publishedAt": "2024-03-05T21:56:05Z",
    "description": "Here's how everything shook out as the deadline came and went.",
    "author": "Yahoo Sports Staff",
    "content": "The NFL franchise tag deadline has come and gone at 4 p.m. ET.\r\nWhere did everything shake out?\r\nWhich players received the franchise tag?\r\nTee Higgins, Cincinnati Bengals WRL'Jarius Sneed, Kansas Ci… [+8361 chars]",
    "jokes": [
      "So, the NFL franchise tag deadline has passed and Josh Allen and Michael Pittman Jr. got tagged. You know you're really important when your job uses a system more complicated than your Facebook relationship status!"
    ]
  },
  {
    "sourceName": "Associated Press",
    "title": "Independent Sen. Kyrsten Sinema of Arizona says she won't seek reelection, avoiding a 3-way race - The Associated Press",
    "url": "https://apnews.com/article/kyrsten-sinema-arizona-8043c3333e6d87da2404f58339f1e1e6",
    "urlToImage": "https://dims.apnews.com/dims4/default/e466254/2147483647/strip/true/crop/3197x1798+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F55%2F67878e2cc1a3d7ea60601063b03b%2Fdb0ca1b4b6dd445db7e6a89e93e84d0f",
    "publishedAt": "2024-03-05T21:56:00Z",
    "description": "Her decision Tuesday comes after her estrangement from the Democratic Party left her politically homeless and without a clear path to reelection.",
    "author": "JONATHAN J. COOPER",
    "content": "PHOENIX (AP) Independent Sen. Kyrsten Sinema of Arizona announced on Tuesday that she wont run for a second term after her estrangement from the Democratic Party left her politically homeless and wit… [+7271 chars]",
    "jokes": [
      "\"Well, Senator Kyrsten Sinema announced she won't seek reelection, apparently she's been feeling politically homeless. I wouldn't be surprised if she starts a GoFundMe for a new political party!\""
    ]
  },
  {
    "sourceName": "CNN",
    "title": "Diet drinks may boost risk of dangerous heart condition by 20%, study says - CNN",
    "url": "https://www.cnn.com/2024/03/05/health/diet-and-sugary-drinks-atrial-fibrillation-wellness/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-825986476.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-05T21:38:00Z",
    "description": "Artificially sweetened drinks are linked to a 20% higher risk of atrial fibrillation while sugary beverages raise that risk by 10%, a new study found.",
    "author": "Sandee LaMotte",
    "content": "Sign up for CNNs Eat, But Better: Mediterranean Style. Our eight-part guide shows you a delicious expert-backed eating lifestyle that will boost your health for life.\r\nDrinking two liters or more per… [+5340 chars]",
    "jokes": [
      "So, a new study says diet drinks may boost the risk of a dangerous heart condition by 20%. I guess that's why they call it \"Coca-Cola Zero\" - zero chance of a healthy heart!"
    ]
  },
  {
    "sourceName": "WYFF4 Greenville",
    "title": "Latest updates on Facebook, Instagram outage Tuesday - WYFF4 Greenville",
    "url": "https://www.wyff4.com/article/facebook-not-working-instagram/60095167",
    "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/facebook-instragram-65e748ea55cde.png?crop=1.00xw:1.00xh;0,0&resize=1200:*",
    "publishedAt": "2024-03-05T21:26:00Z",
    "description": "If you aren't able to get on Facebook or Instagram this morning, you are not alone.",
    "author": "Stephanie Moore",
    "content": "GREENVILLE, S.C. —Update at 1 p.m.: \r\nTweet from Meta's director of communications Andy Stone: \r\n\"Earlier today, a technical issue caused people to have difficulty accessing some of our services. We … [+2111 chars]",
    "jokes": [
      "You know, Facebook and Instagram were down again yesterday. I guess even they're trying to spend less time on social media!"
    ]
  },
  {
    "sourceName": "CNN",
    "title": "Sen. Bob Menendez hit with new conspiracy and obstruction of justice charges - CNN",
    "url": "https://www.cnn.com/2024/03/05/politics/bob-menendez-new-charges/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/240122170558-bob-menendez-01112024.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-05T21:22:00Z",
    "description": "New Jersey Democratic Sen. Bob Menendez was indicted Tuesday on a dozen new criminal charges related to a years-long bribery scheme involving the government of Egypt and Qatar.",
    "author": "Kara Scannell",
    "content": "New Jersey Democratic Sen. Bob Menendez was indicted Tuesday on a dozen new criminal charges related to a years-long bribery scheme involving the governments of Egypt and Qatar.\r\nThe new charges come… [+3431 chars]",
    "jokes": [
      "Well, it seems Senator Bob Menendez has been hit with new conspiracy and obstruction of justice charges. At this point, he's got more charges than a Black Friday sale at Best Buy!"
    ]
  },
  {
    "sourceName": "Salon",
    "title": "Amid all the rumors, Kate Middleton spotted for the first time post-surgery - Salon",
    "url": "https://www.salon.com/2024/03/05/kate-middleton-sighting-surgery/",
    "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media2.salon.com/2024/03/kate_middleton_1809380642.jpg",
    "publishedAt": "2024-03-05T21:04:00Z",
    "description": "Kate Middleton spotted post-surgery for the first time amid all the conspiracy theories of her absence",
    "author": null,
    "content": null,
    "jokes": [
      "You know, I heard Kate Middleton was spotted for the first time post-surgery. I guess the royal family finally decided it was time for her to get that 'commoner' removed."
    ]
  },
  {
    "sourceName": "CNN",
    "title": "Dow tumbles more than 400 points as tech woes rattle Wall Street - CNN",
    "url": "https://www.cnn.com/2024/03/05/investing/stocks-apple-tech/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/2024-03-05t171518z-1230086580-rc2pf6a4o0iq-rtrmadp-3-usa-stocks.JPG?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-05T21:00:00Z",
    "description": "Stocks tumbled Tuesday with tech stocks leading the way, continuing to retreat from record highs set last week.",
    "author": "Krystal Hur",
    "content": "Stocks tumbled Tuesday with tech stocks leading the way, continuing to retreat from record highs set last week.\r\nThe Dow fell 405 points, or 1%, after declining more than 500 points at its session lo… [+1071 chars]",
    "jokes": [
      "Apparently, the Dow fell over 400 points yesterday. You know things are bad when even the stock market is doing the \"downward dog\" yoga pose!"
    ]
  },
  {
    "sourceName": "CNN",
    "title": "How the 2024 total solar eclipse will differ from 2017 - CNN",
    "url": "https://www.cnn.com/2024/03/05/world/total-solar-eclipse-differences-scn/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230623142137-02-solar-eclipse-2017-file.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-05T20:39:00Z",
    "description": "The total solar eclipse occurring on April 8 is expected to trace a wider path and last longer than the previous total solar eclipse that crossed the US in 2017.",
    "author": "Ashley Strickland",
    "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nWhen a total solar eclipse creates a spectacle in the … [+4891 chars]",
    "jokes": [
      "\"You know, the 2024 total solar eclipse is reported to be different from 2017's. Let's hope it's not going to demand a sequel like every Hollywood movie these days!\""
    ]
  },
  {
    "sourceName": "Al Jazeera English",
    "title": "Gaza ceasefire talks fail to make breakthrough with Ramadan approaching - Al Jazeera English",
    "url": "https://www.aljazeera.com/news/2024/3/5/gaza-ceasefire-talks-fail-to-make-breakthrough-with-ramadan-approaching",
    "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/03/2024-03-05T153704Z_984556980_RC2PF6AUIK8B_RTRMADP_3_ISRAEL-PALESTINIANS-BLINKEN-1709665391.jpg?resize=1920%2C1440",
    "publishedAt": "2024-03-05T20:12:35Z",
    "description": "Three days of negotiations end at an impasse, as Hamas and Israel insist the other give in to their demands.",
    "author": "Al Jazeera",
    "content": "Three days of negotiations with Hamas over a ceasefire in Gaza have failed to achieve a breakthrough, less than a week before the start of the Muslim holy month of Ramadan the informal deadline for a… [+3535 chars]",
    "jokes": [
      "It's been reported that talks about a ceasefire in Gaza have failed to make a breakthrough. At this point, even Netflix is saying, \"Are you still negotiating?\""
    ]
  },
  {
    "sourceName": "Yahoo Entertainment",
    "title": "Bitcoin hits new all-time high near $69,000, before tumbling - Yahoo Finance",
    "url": "https://finance.yahoo.com/news/bitcoin-hits-new-all-time-high-near-69000-before-tumbling-151901990.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/NiFJSCEH0UUDcnRcJeEVTQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTg-/https://s.yimg.com/os/creatr-uploaded-images/2024-02/2efd16f0-da3e-11ee-b9af-ff555f29d3aa",
    "publishedAt": "2024-03-05T20:05:19Z",
    "description": "The world's largest cryptocurrency completed a remarkable comeback from a 2022 collapse, exceeding the high it set during its last boom in 2021.",
    "author": "David Hollerith",
    "content": "Bitcoin (BTC-USD) reached an all-time high Tuesday before falling back as some investors locked in their winnings.\r\nA new frenzy surrounding the world's largest cryptocurrency pushed the price to to … [+5660 chars]",
    "jokes": [
      "You know Bitcoin hit a new all-time high near $69,000 before tumbling back down? I guess even virtual currency has a fear of heights!"
    ]
  },
  {
    "sourceName": "Engadget",
    "title": "Google is changing its search results to weed out SEO spam - Engadget",
    "url": "https://www.engadget.com/google-is-changing-its-search-results-to-weed-out-seo-spam-195259063.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/3N.Gl22srYcixG1SjdSraQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-07/9ac7b200-2431-11ee-afe7-d6baef0d20b1",
    "publishedAt": "2024-03-05T19:52:59Z",
    "description": "Amid complaints about its search results declining in quality, Google is tweaking its algorithms to do a better job of weeding out spammy or automated...",
    "author": "Will Shanklin",
    "content": "Amid complaints that its search results have declined in quality, Google is tweaking its algorithms to do a better job of weeding out spammy or automated content. The company says the ranking updates… [+2825 chars]",
    "jokes": [
      "So Google is changing its search results to weed out SEO spam. I guess it's their way of saying, \"Sorry, we're not interested in your 'get rich quick' schemes...we already figured that one out.\""
    ]
  },
  {
    "sourceName": "Entertainment Weekly",
    "title": "Don't expect Dakota Johnson to make more movies like 'Madame Web' - Entertainment Weekly News",
    "url": "https://ew.com/dakota-johnson-wont-make-more-movies-like-madame-web-8604566",
    "urlToImage": "https://ew.com/thmb/aAwxzUyok61lNfKayCbMYtjCjAM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Dakota-Johnson-Madame-Web-111523-0c8a01b2f82944e49b654cd8b56a78a0.jpg",
    "publishedAt": "2024-03-05T19:30:35Z",
    "description": "Dakota Johnson isn't planning to make more movies like 'Madame Web' and is 'not surprised' by how it's been received: 'I don't make sense in that world.'",
    "author": "https://www.facebook.com/entertainmentweekly",
    "content": "Dakota Johnson may not have the same power of foresight as her titular heroine in Madame Web, but her own vision of the future doesn't include making more high-profile comic book movies.\r\nIn a new Bu… [+2097 chars]",
    "jokes": [
      "So Dakota Johnson says she's done with comic book movies after Madame Web. I guess she saw herself in another one and thought, \"Nope, that's a web I don't want to get tangled in!\""
    ]
  },
  {
    "sourceName": "Detroit Free Press",
    "title": "Clinton Twp. officials: Fire site shouldn't have had butane, nitrous - Detroit Free Press",
    "url": "https://www.freep.com/story/news/local/michigan/macomb/2024/03/05/clinton-township-fire-explosion-butane-nitrous/72851330007/",
    "urlToImage": "https://www.freep.com/gcdn/authoring/authoring-images/2024/03/05/PDTF/72854374007-explosion-030524-13-mw.jpg?crop=2399,1351,x0,y124&width=2399&height=1351&format=pjpg&auto=webp",
    "publishedAt": "2024-03-05T19:23:05Z",
    "description": "Cleanup continues Tuesday around 15 Mile and Groesbeck in Clinton Township after location rocked by fire, explosions Monday night.",
    "author": "Christina Hall",
    "content": "The building where a massive fire rocked Clinton Township and neighboring Macomb County communities on Monday that led to explosions causing the death of a teenager and injury to a firefighter wasn't… [+6765 chars]",
    "jokes": [
      "You know things are bad in Clinton Township when even the buildings are saying, \"Forget this, I'm going out with a bang!\" I mean, with all that butane and nitrous, it was less of an office building and more of a 'Do It Yourself' rocket launch site."
    ]
  },
  {
    "sourceName": "MacRumors",
    "title": "Make Sure to Update: iOS 17.4 and iPadOS 17.4 Fix Two Major Security Vulnerabilities - MacRumors",
    "url": "https://www.macrumors.com/2024/03/05/ios-17-4-vulnerability-fix/",
    "urlToImage": "https://images.macrumors.com/t/FWFeAmxnHKf7vkk_MCBh9TcNMVg=/1600x/article-new/2023/05/bug-security-vulnerability-issue-fix-larry.jpg",
    "publishedAt": "2024-03-05T19:02:29Z",
    "description": "iPhone and iPad owners may want to update to iOS 17.4 and iPadOS 17.4 in the near future, as the updates address two security vulnerabilities that...",
    "author": "Juli Clover",
    "content": "iPhone and iPad owners may want to update to iOS 17.4 and iPadOS 17.4 in the near future, as the updates address two security vulnerabilities that may have been exploited to gain access to user devic… [+796 chars]",
    "jokes": [
      "Apple just released iOS 17.4 to fix two major security vulnerabilities - now, hackers will find it slightly harder to discover you've been playing Candy Crush at work. But don't worry, your secret of still not being able to beat level 35 is safe with us!"
    ]
  },
  {
    "sourceName": "CNN",
    "title": "Jason Kelce shows us what an involved father can do for their children - CNN",
    "url": "https://www.cnn.com/2024/03/05/health/jason-kelce-empathy-retirement-speech-wellness/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/240304185408-jason-kelce.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-03-05T19:02:00Z",
    "description": "At 6’3” and 295 pounds, former Philadelphia Eagles center Jason Kelce often towers over other people. His big bushy beard makes him look like a modern-day Paul Bunyan.",
    "author": null,
    "content": "At 63 and 295 pounds, former Philadelphia Eagles center Jason Kelce often towers over other people. His big bushy beard makes him look like a modern-day Paul Bunyan.\r\nAs he announced his retirement, … [+4777 chars]",
    "jokes": [
      "\"So Jason Kelce, the former center for the Philadelphia Eagles, announced his retirement recently. At 63, 295 pounds, and with that bushy beard, he's not just retiring from football, he's auditioning for the lead role in 'Santa Claus: The Offseason'!\""
    ]
  },
  {
    "sourceName": "Fox Business",
    "title": "Banking industry erupts over Biden admin's new rule on credit card late fees: 'Should not be allowed' - Fox Business",
    "url": "https://www.foxbusiness.com/media/banking-industry-erupts-biden-admins-new-rule-credit-card-late-fees-should-not-allowed",
    "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2024/03/0/0/CREDIT-CARDS-GETTY.jpg?ve=1&tl=1",
    "publishedAt": "2024-03-05T17:54:00Z",
    "description": "A new Biden era regulation on the banking industry is \"endangering\" Americans' financial health, according to coalition groups and the Senate Banking Committee.",
    "author": "Kristen Altus",
    "content": "Banking and credit card companies have started reacting to a new Biden administration rule that puts an $8 ceiling on credit card late fees.\r\n\"Today’s flawed final rule will not only reduce competiti… [+4159 chars]",
    "jokes": [
      "\"So, the Biden administration has put an $8 ceiling on credit card late fees. I guess now banks will have to find a new way to fund their annual 'Screw the Little Guy' gala!\""
    ]
  },
  {
    "sourceName": "ABC News",
    "title": "Ukraine claims it has sunk another Russian warship in the Black Sea using high-tech sea drones - ABC News",
    "url": "https://abcnews.go.com/International/wireStory/ukraine-claims-sunk-russian-warship-black-sea-high-107799793",
    "urlToImage": "https://i.abcnewsfe.com/a/c6a6c7d7-cc09-4292-85d1-04a9b84d57d4/wirestory_a316215f5d9fc88a488ef2d99eb828c9_16x9.jpg?w=1600",
    "publishedAt": "2024-03-05T17:45:32Z",
    "description": "Ukraine claims it has sunk another Russian warship in the Black Sea using high-tech sea drones as Kyiv’s forces take aim at targets well behind the war’s front line",
    "author": "ILLIA NOVIKOV Associated Press",
    "content": "KYIV, Ukraine -- Ukraine claimed Tuesday it has sunk another Russian warship in the Black Sea using high-tech sea drones as Kyivs forces take aim at targets well behind the wars front line. Russian a… [+3775 chars]",
    "jokes": [
      "You know, Ukraine claimed they sunk a Russian warship using high-tech sea drones. At this point, I'm not sure if I'm reading a war report or a review for the next 'Transformers' movie!"
    ]
  }
]